<template>
<div class="information-page">
    
    <div class="text-main">
      <h3>学校简介</h3>
      <p>{{ truncatedText }}<button @click="toggleText">详情</button></p>
    </div>
    <schoolintro  v-if="isCollapsed" @close="toggleText"/>
    <div class="text-main" >
        <h3>学校地图</h3>
    </div>
</div>
</template>
<script setup>
import { ref } from 'vue';
import schoolintro from '@/components/schoolintro.vue';
const isCollapsed = ref(false);
const fullText = `学校有4个校区，其中，崂山校区、鱼山校区和浮山校区共占地2400余亩；西海岸校区规划占地约2800亩，2022年9月一期建成启用。设有1个学部、20个学院和1个基础教学中心。现有在校生35400余人，其中本科生17200余人、硕士研究生14500余人、博士研究生3400余人、外国留学生330余人。教职工4048人，其中专任教师2167人，博士生导师702人，正高级专业技术人员771人、副高级专业技术人员1034人，中国科学院院士6人、中国工程院院士9人。
学校以培养德智体美劳全面发展、具有民族精神和社会责任感、具有国际视野和合作竞争意识、具有科学精神和人文素养、具有创新意识和实践能力的高素质创新型人才为目标，以造就国家海洋事业的领军人才和骨干力量为特殊使命。学校遵循“通识为体，专业为用”的本科教育理念，实行有限条件的自主选课制度和学业识别与毕业专业识别确认制度，努力培养复合型、高素质人才。毕业生中已有16人当选中国科学院或中国工程院院士，3人先后担任国家海洋局局长，参加中国第一次南极考察的75位科学家中一半以上是学校毕业生。
学校积极支持崂山实验室建设，协同打造国家战略科技力量。主持建设我国地球科学领域首个教育部前沿科学中心（深海圈层与地球系统前沿科学中心），主持海洋领域首个国家自然科学基金委基础科学中心项目（多场多体多尺度耦合及其对海工装备性能与安全的影响机制）。建有全国重点实验室、国家工程技术研究中心、国家地方联合工程研究中心、教育部重点实验室、农业部重点实验室等省部级以上各类科研基地平台40余个。拥有科学考察实习船舶3艘，包括5000吨级新型深远海综合科考实习船“东方红3”、3000吨级海洋综合科学考察实习船“东方红2”、300吨级的“天使1”科考交通补给船，形成了自近岸、近海至深远海并辐射到极地的海上综合流动实验室系统，具备了一流的海上现场观测能力。
学校在地球科学、植物学与动物学、工程技术、化学、材料科学、农业科学、生物学与生物化学、环境学与生态学、药理学与毒理学、微生物学、计算机科学、社会科学12个学科（领域）进入ESI全球科研机构排名前1%。作为第一完成单位，获国家技术发明一等奖1项、二等奖3项，自然科学二等奖2项，科技进步二等奖11项。“十三五”以来，主持国家级各类项目2200余项，获省部级科技奖励104项，在国内外高水平期刊发表论文32000余篇，申请发明专利4500余项，授权发明专利2600余项，其中授权国际发明专利44项。
学校的发展目标是：到2030年，建成世界一流的综合性海洋大学；到本世纪中叶，建成特色显著的世界一流大学。`;

const truncatedText = fullText.slice(0, 200)+'……';

const toggleText = () => {
  isCollapsed.value = !isCollapsed.value;
};

</script>
<style scoped>
.information-page{
    width: 730px;
    height: auto;
    padding: 10px;
    white-space: pre-wrap; /* 保留空格和换行符 */
    background-color: #f0f0f0;
    border-radius:  0 0 10px 10px;

}
.text-main{
    background-color: #ffffff;
    padding: 0 10px 0 10px;
    height: auto;
}
button {
  margin-top: 10px;
  cursor: pointer;
}
</style>